app/controllers/songs_controller.rb

  def edit
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist.nil?
        redirect_to artists_path, alert: "Artist not found."
      else # no artist id so its just a /songs/1/edit path for example
        @song = @artist.songs.find_by(id: params[:id])
        redirect_to artist_songs_path(@artist), alert: "Song not found." if @song.nil?
      end
    else
      @song = Song.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = 1 LIMIT 1  [["artist_id", 1]]
SELECT  "songs".* FROM "songs" WHERE (33) LIMIT 1